Revit 2024 API
Application.NewPointOnEdge Method
Create a PointOnEdge object which is used to define the placement of a ReferencePoint.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PointOnEdge NewPointOnEdge(
	Reference edgeReference,
	PointLocationOnCurve locationOnCurve
)
Visual Basic
Public Function NewPointOnEdge ( _
	edgeReference As Reference, _
	locationOnCurve As PointLocationOnCurve _
) As PointOnEdge
Visual C++
public:
PointOnEdge^ NewPointOnEdge(
	Reference^ edgeReference,
	PointLocationOnCurve^ locationOnCurve
)
Parameters
edgeReference
Type: Autodesk.Revit.DB.Reference
The reference whose edge the object will be created on.
locationOnCurve
Type: Autodesk.Revit.DB.PointLocationOnCurve
The location on the edge.
Return Value
If creation was successful then a new object is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument edgeReference or locationOnCurve is null.
See Also
Application Class
Autodesk.Revit.Creation Namespace